; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain zenotravel)
;(:requirements :typing :fluents)
(:types locatable city - object
  aircraft person - locatable)
(:predicates (located ?x - locatable  ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
      (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (located ?p ?c)
                 (located ?a ?c))
 :effect (and (not (located ?p ?c))
              (in ?p ?a)
    (increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (located ?a ?c))
 :effect (and (not (in ?p ?a))
              (located ?p ?c)
    (decrease (onboard ?a) 1)))

(:action fly-slow
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a)
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))

(:action fly-fast
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
  )
)

(:action refuel
 :parameters (?a - aircraft)
 :precondition (and (> (capacity ?a) (fuel ?a))

    )
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2)
(:domain zenotravel)
(:objects
  plane1 - aircraft
  person1 - person
  person2 - person
  person3 - person
  city0 - city
  city1 - city
  city2 - city
  )
(:init
  (located plane1 city0)
  (= (capacity plane1) 6000)
  (= (fuel plane1) 4000)
  (= (slow-burn plane1) 4)
  (= (fast-burn plane1) 15)
  (= (onboard plane1) 0)
  (= (zoom-limit plane1) 8)
  (located person1 city0)
  (located person2 city0)
  (located person3 city1)
  (= (distance city0 city0) 0)
  (= (distance city0 city1) 678)
  (= (distance city0 city2) 775)
  (= (distance city1 city0) 678)
  (= (distance city1 city1) 0)
  (= (distance city1 city2) 810)
  (= (distance city2 city0) 775)
  (= (distance city2 city1) 810)
  (= (distance city2 city2) 0)
  (= (total-fuel-used) 0)

)
(:goal (and
  (located person1 city2)
  (located person2 city1)
  (located person3 city2)
  ))
(:metric  minimize (total-fuel-used) )

)

; plan
1. (board person1 plane1 city0)
   deleted: (located person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 3
2. (fly-slow plane1 city0 city1)
   deleted: (located plane1 city0)
   added: (located plane1 city1)
   changed: (total-fuel-used) from 0 to 2712, (fuel plane1) from 4000 to 1288
   goals met: 0 of 3
3. (refuel plane1)
   changed: (fuel plane1) from 1288 to 6000
   goals met: 0 of 3
4. (board person3 plane1 city1)
   deleted: (located person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 3
5. (fly-slow plane1 city1 city2)
   deleted: (located plane1 city1)
   added: (located plane1 city2)
   changed: (total-fuel-used) from 2712 to 5952, (fuel plane1) from 6000 to 2760
   goals met: 0 of 3
6. (refuel plane1)
   changed: (fuel plane1) from 2760 to 6000
   goals met: 0 of 3
7. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (located person1 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 3
8. (fly-slow plane1 city2 city0)
   deleted: (located plane1 city2)
   added: (located plane1 city0)
   changed: (total-fuel-used) from 5952 to 9052, (fuel plane1) from 6000 to 2900
   goals met: 1 of 3
9. (board person2 plane1 city0)
   deleted: (located person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 3
10. (fly-slow plane1 city0 city1)
   deleted: (located plane1 city0)
   added: (located plane1 city1)
   changed: (total-fuel-used) from 9052 to 11764, (fuel plane1) from 2900 to 188
   goals met: 1 of 3
11. (refuel plane1)
   changed: (fuel plane1) from 188 to 6000
   goals met: 1 of 3
12. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (located person2 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 3
13. (fly-slow plane1 city1 city2)
   deleted: (located plane1 city1)
   added: (located plane1 city2)
   changed: (total-fuel-used) from 11764 to 15004, (fuel plane1) from 6000 to 2760
   goals met: 2 of 3
14. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (located person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 3
